assignHOWTO.tex
% Created 2012-07-02 Mon 07:11
\documentclass[10pt,english]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{float}
\usepackage{wrapfig}
\usepackage{soul}
\usepackage{textcomp}
\usepackage{marvosym}
\usepackage{wasysym}
\usepackage{latexsym}
\usepackage{amssymb}
\usepackage{hyperref}
\tolerance=1000
\usepackage[paperwidth=8.5in,paperheight=11in]{geometry}
\geometry{verbose,tmargin=0.5in,bmargin=1in,lmargin=1in,rmargin=1in}
\providecommand{\alert}[1]{\textbf{#1}}

\title{HOWTO Submit Assignments for STAT 5848/6948}
%\author{G. Jay Kerns}
\date{\vspace{-0.5in}Summer 2012}
\hypersetup{
  pdfkeywords={},
  pdfsubject={},
  pdfcreator={Emacs Org-mode version 7.8.02}}

\begin{document}

\maketitle

\thispagestyle{empty}

\section*{Who}
\label{sec-1}

You.
\section*{What}
\label{sec-2}

All STAT 5848/6948 assignments to be turned in for a grade should be submitted as \texttt{Sweave} files, that is, a text file with file extension \texttt{.Rnw} which contains \texttt{R} code mixed with \(\LaTeX\) code to ultimately come together to comprise a self-contained statistical report. Your file should be named according to the following scheme:

\begin{verbatim}
 LastNameDueDate.Rnw
\end{verbatim}

So, for example, if I were going to submit an assignment due on July 27, I would submit a file called \texttt{Kerns072712.Rnw}.  Under rare circumstances (\emph{e.g.} your Term Project) you may also need to send an \texttt{.RData} file containing data and/or relevant functions, in which case, it should similarly follow the above described naming convention. 
\section*{When}
\label{sec-3}

Assignments are due \emph{before class} on the due-date assigned.  If it isn't in my email \texttt{INBOX} by \texttt{13:00:00}, then it's \textbf{late}, period.  Early submissions (to protect against the occasional email snafu) are welcomed and encouraged (for the final exam assignment, in particular).
\section*{Where}
\label{sec-4}

Send STAT 5848/6948 submissions to my YSU email address, \texttt{gkerns@ysu.edu}.  Attach your \texttt{.Rnw} file to the email.  The subject line of the email should read \texttt{STAT 5848/6948 LastName DueDate}.  So, for instance, if I were turning in an assignment due on July 27 my email subject would read \texttt{STAT 5848/6948 Kerns 072712}.
\section*{How}
\label{sec-5}

Use the templates I provide plus the \texttt{R} scripts we discuss in class to help you write your report(s).  In every case the work you need to do is scantly more than copy-pasting previous work and tweaking it a bit for your particular assignment.  Don't reinvent the wheel;  it's rolling right there in front of you.  If you have a personal computer at home and can manage to get it up and running to meet all of the installation requirements, then I encourage you to work at home.  Everything's \textbf{free}, after all.  Nevertheless, if you \emph{don't} own a personal computer or \emph{can't} manage to get everything running, then you can always use the Computer Lab in Lincoln 414.  I have checked it out and confirmed that everything there works without any trouble. 
\section*{Why}
\label{sec-6}

\begin{description}
\item[Short answer:] you'd like to pass the class.
\item[Long answer:] you have a burning, aching desire in the deepest reachest of your fiery intellect to become the baddest-assed computational statistician this side of the Mississippi River, and submission of a data analysis assignment for STAT 5848/6948 Summer 2012 is, in your view, one of the preliminary first steps in a long series of incremental successes toward that ultimate goal of superlative awesome-ness.
\end{description}

\end{document}